In [36]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [37]:
import boto3
client = boto3.client('ssm')
user=client.get_parameter(Name='redshift_user').get('Parameter')
password=client.get_parameter(Name='redshift_password').get('Parameter')
host='examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com'
port=5439

In [38]:
import os
os.environ['DATABASE_URL']='postgresql://{user}:{password}@{host}:{port}/dev'.format(**{
    'user':user['Value'],
    'password':password['Value'],
    'host':host,
    'port':port
})

In [39]:
%sql select * from sales limit 2

 * postgresql://awsuser:***@examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com:5439/dev
(psycopg2.OperationalError) SSL connection has been closed unexpectedly

[SQL: select * from sales limit 2]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [40]:
%sql select * from event limit 2

 * postgresql://awsuser:***@examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com:5439/dev
2 rows affected.

[(423, 303, 8, 1827, 'La Damnation de Faust', datetime.datetime(2008, 1, 1, 19, 30)),
 (1334, 208, 6, 1827, 'The King and I', datetime.datetime(2008, 1, 1, 14, 30))]

In [41]:
%sql select * from date limit 2

 * postgresql://awsuser:***@examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com:5439/dev
2 rows affected.

[(1827, datetime.date(2008, 1, 1), 'WE ', 1, 'JAN  ', '1    ', 2008, True),
 (1831, datetime.date(2008, 1, 5), 'SU ', 2, 'JAN  ', '1    ', 2008, False)]

%sql select * from users limit 2

### :::Total sales by Given CalDay/Month/year analysis:::

In [42]:
%%sql select sum(qtysold) total_qty_sold,caldate from sales s join date d 
on s.dateid=d.dateid
group by caldate 
order by sum(qtysold) desc limit 10

 * postgresql://awsuser:***@examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com:5439/dev
10 rows affected.

[(1216, datetime.date(2008, 7, 20)),
 (1198, datetime.date(2008, 9, 10)),
 (1187, datetime.date(2008, 10, 23)),
 (1173, datetime.date(2008, 9, 28)),
 (1171, datetime.date(2008, 8, 6)),
 (1170, datetime.date(2008, 2, 20)),
 (1160, datetime.date(2008, 9, 15)),
 (1158, datetime.date(2008, 7, 4)),
 (1158, datetime.date(2008, 10, 17)),
 (1154, datetime.date(2008, 6, 10))]

### Top 10 Buyers

In [43]:
%%sql
select u.username,u.firstname,s.qtysold,d.caldate from sales s join users u on 
s.buyerid=u.userid join date d
on s.dateid=d.dateid
order by qtysold desc
limit 10

 * postgresql://awsuser:***@examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com:5439/dev
10 rows affected.

[('BSN02SPX', 'Beverly', 8, datetime.date(2008, 3, 23)),
 ('DFD02LFG', 'Harrison', 8, datetime.date(2008, 3, 18)),
 ('LEM71QRL', 'Cole', 8, datetime.date(2008, 3, 3)),
 ('ORB21MOM', 'Hasad', 8, datetime.date(2008, 5, 4)),
 ('BNR06CAF', 'Genevieve', 8, datetime.date(2008, 3, 14)),
 ('EJT07WZV', 'Amelia', 8, datetime.date(2008, 2, 28)),
 ('RKR09VTF', 'April', 8, datetime.date(2008, 3, 18)),
 ('KTN76IOU', 'Ignacia', 8, datetime.date(2008, 3, 16)),
 ('XRE56IAJ', 'Garth', 8, datetime.date(2008, 1, 18)),
 ('VVD09UTT', 'Vaughan', 8, datetime.date(2008, 1, 13))]

### Total Sales/Revenue By Month

In [44]:
%%sql 
select date_trunc('month',saletime) sales_month,
sum(qtysold) total_sales_cnt,
sum(qtysold*pricepaid) total_revenue,
sum(qtysold*commission) total_commission
from sales
group by date_trunc('month',saletime)
order by sales_month

 * postgresql://awsuser:***@examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com:5439/dev
12 rows affected.

[(datetime.datetime(2008, 1, 1, 0, 0), 15306, Decimal('12203733.00'), Decimal('1830559.95')),
 (datetime.datetime(2008, 2, 1, 0, 0), 28528, Decimal('22440414.00'), Decimal('3366062.10')),
 (datetime.datetime(2008, 3, 1, 0, 0), 32840, Decimal('26569556.00'), Decimal('3985433.40')),
 (datetime.datetime(2008, 4, 1, 0, 0), 30827, Decimal('24884236.00'), Decimal('3732635.40')),
 (datetime.datetime(2008, 5, 1, 0, 0), 32291, Decimal('25536717.00'), Decimal('3830507.55')),
 (datetime.datetime(2008, 6, 1, 0, 0), 31361, Decimal('24732253.00'), Decimal('3709837.95')),
 (datetime.datetime(2008, 7, 1, 0, 0), 33011, Decimal('26007946.00'), Decimal('3901191.90')),
 (datetime.datetime(2008, 8, 1, 0, 0), 32824, Decimal('25409113.00'), Decimal('3811366.95')),
 (datetime.datetime(2008, 9, 1, 0, 0), 32240, Decimal('25248180.00'), Decimal('3787227.00')),
 (datetime.datetime(2008, 10, 1, 0, 0), 33580, Decimal('26234980.00'), Decimal('3935247.00')),
 (datetime.datetime(2008, 11, 1, 0, 0), 28397, Decimal('22334995.00'), Decimal('3350249.25')),
 (datetime.datetime(2008, 12, 1, 0, 0), 14144, Decimal('11154812.00'), Decimal('1673221.80'))]

### Rate of Increase in sales monthwise i.e. GrowthRate
((sales in cur year - sales in prev year)/sales in prev year) * 100

In [45]:
%%sql


with cte as 
(select date_trunc('month',saletime) current_salemonth,
sum(qtysold) total_tickets_sold
from sales s1 
group by date_trunc('month',saletime))

select 
s1.current_salemonth,
s2.current_salemonth prev_month,
s1.total_tickets_sold cur_month_ticket_sales,
s2.total_tickets_sold prev_month_ticket_sales,
((s1.total_tickets_sold-s2.total_tickets_sold)/s2.total_tickets_sold::decimal(16,4))*100 growth_rate
from 
cte s1 left join cte s2
on add_months(s1.current_salemonth,-1)= s2.current_salemonth 
order by s1.current_salemonth

 * postgresql://awsuser:***@examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com:5439/dev
12 rows affected.

[(datetime.datetime(2008, 1, 1, 0, 0), None, 15306, None, None),
 (datetime.datetime(2008, 2, 1, 0, 0), datetime.datetime(2008, 1, 1, 0, 0), 28528, 15306, Decimal('86.3844244087200')),
 (datetime.datetime(2008, 3, 1, 0, 0), datetime.datetime(2008, 2, 1, 0, 0), 32840, 28528, Decimal('15.1149747616300')),
 (datetime.datetime(2008, 4, 1, 0, 0), datetime.datetime(2008, 3, 1, 0, 0), 30827, 32840, Decimal('-6.1297198538300')),
 (datetime.datetime(2008, 5, 1, 0, 0), datetime.datetime(2008, 4, 1, 0, 0), 32291, 30827, Decimal('4.7490835955400')),
 (datetime.datetime(2008, 6, 1, 0, 0), datetime.datetime(2008, 5, 1, 0, 0), 31361, 32291, Decimal('-2.8800594592900')),
 (datetime.datetime(2008, 7, 1, 0, 0), datetime.datetime(2008, 6, 1, 0, 0), 33011, 31361, Decimal('5.2613118204100')),
 (datetime.datetime(2008, 8, 1, 0, 0), datetime.datetime(2008, 7, 1, 0, 0), 32824, 33011, Decimal('-0.5664778407100')),
 (datetime.datetime(2008, 9, 1, 0, 0), datetime.datetime(2008, 8, 1, 0, 0), 32240, 32824, Decimal('-1.7791859614900')),
 (datetime.datetime(2008, 10, 1, 0, 0), datetime.datetime(2008, 9, 1, 0, 0), 33580, 32240, Decimal('4.1563275434200')),
 (datetime.datetime(2008, 11, 1, 0, 0), datetime.datetime(2008, 10, 1, 0, 0), 28397, 33580, Decimal('-15.4347826086900')),
 (datetime.datetime(2008, 12, 1, 0, 0), datetime.datetime(2008, 11, 1, 0, 0), 14144, 28397, Decimal('-50.1919216818600'))]

In [46]:
%sql select * from event limit 2

 * postgresql://awsuser:***@examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com:5439/dev
2 rows affected.

[(423, 303, 8, 1827, 'La Damnation de Faust', datetime.datetime(2008, 1, 1, 19, 30)),
 (1334, 208, 6, 1827, 'The King and I', datetime.datetime(2008, 1, 1, 14, 30))]

In [47]:
%sql select * from venue limit 2

 * postgresql://awsuser:***@examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com:5439/dev
2 rows affected.

[(2, 'Columbus Crew Stadium', 'Columbus', 'OH', 0),
 (4, 'CommunityAmerica Ballpark', 'Kansas City', 'KS', 0)]

In [48]:
%sql select * from listing limit 2

 * postgresql://awsuser:***@examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com:5439/dev
2 rows affected.

[(614, 25339, 770, 1827, 10, Decimal('236.00'), Decimal('2360.00'), datetime.datetime(2008, 1, 1, 5, 7, 30)),
 (776, 20797, 1811, 1827, 18, Decimal('133.00'), Decimal('2394.00'), datetime.datetime(2008, 1, 1, 6, 59, 39))]

In [49]:
%sql select * from category limit 2

 * postgresql://awsuser:***@examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com:5439/dev
2 rows affected.

[(2, 'Sports', 'NHL', 'National Hockey League'),
 (4, 'Sports', 'NBA', 'National Basketball Association')]

In [50]:
%sql select * from date limit 2

 * postgresql://awsuser:***@examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com:5439/dev
2 rows affected.

[(1827, datetime.date(2008, 1, 1), 'WE ', 1, 'JAN  ', '1    ', 2008, True),
 (1831, datetime.date(2008, 1, 5), 'SU ', 2, 'JAN  ', '1    ', 2008, False)]

### Events By City,Month and Categories

In [51]:
%%sql 
select count(1) no_of_events,v.venuecity, c.catgroup,date_trunc('month',d.caldate)
from 
event e join venue v on e.venueid = v.venueid
        join category c on e.catid = c.catid 
        join date d on e.dateid=d.dateid
group by v.venuecity,c.catgroup,date_trunc('month',d.caldate)
order by no_of_events desc limit 10

 * postgresql://awsuser:***@examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com:5439/dev
10 rows affected.

[(254, 'New York City', 'Shows', datetime.datetime(2008, 3, 1, 0, 0)),
 (225, 'New York City', 'Shows', datetime.datetime(2008, 12, 1, 0, 0)),
 (212, 'New York City', 'Shows', datetime.datetime(2008, 9, 1, 0, 0)),
 (211, 'New York City', 'Shows', datetime.datetime(2008, 4, 1, 0, 0)),
 (210, 'New York City', 'Shows', datetime.datetime(2008, 6, 1, 0, 0)),
 (210, 'New York City', 'Shows', datetime.datetime(2008, 2, 1, 0, 0)),
 (209, 'New York City', 'Shows', datetime.datetime(2008, 11, 1, 0, 0)),
 (208, 'New York City', 'Shows', datetime.datetime(2008, 1, 1, 0, 0)),
 (206, 'New York City', 'Shows', datetime.datetime(2008, 10, 1, 0, 0)),
 (200, 'New York City', 'Shows', datetime.datetime(2008, 8, 1, 0, 0))]

In [55]:
%%sql select d.caldate,c.catgroup,e.*
from 
event e join date d on e.dateid=d.dateid
join category c on c.catid = e.catid
order by caldate asc limit 10

 * postgresql://awsuser:***@examplecluster.cinxqu0isjxw.us-east-1.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2008, 1, 1), 'Shows', 1217, 238, 6, 1827, 'Mamma Mia!', datetime.datetime(2008, 1, 1, 20, 0)),
 (datetime.date(2008, 1, 1), 'Shows', 1334, 208, 6, 1827, 'The King and I', datetime.datetime(2008, 1, 1, 14, 30)),
 (datetime.date(2008, 1, 1), 'Shows', 2811, 207, 7, 1827, 'Spring Awakening', datetime.datetime(2008, 1, 1, 15, 0)),
 (datetime.date(2008, 1, 1), 'Shows', 1376, 235, 6, 1827, 'The King and I', datetime.datetime(2008, 1, 1, 14, 30)),
 (datetime.date(2008, 1, 1), 'Concerts', 3915, 51, 9, 1827, 'Return To Forever', datetime.datetime(2008, 1, 1, 14, 0)),
 (datetime.date(2008, 1, 1), 'Shows', 2099, 211, 7, 1827, 'The Bacchae', datetime.datetime(2008, 1, 1, 19, 30)),
 (datetime.date(2008, 1, 1), 'Shows', 1433, 248, 6, 1827, 'Grease', datetime.datetime(2008, 1, 1, 19, 0)),
 (datetime.date(2008, 1, 1), 'Concerts', 4850, 91, 9, 1827, 'Zappa Plays Zappa', datetime.datetime(2008, 1, 1, 14, 0)),
 (datetime.date(2008, 1, 1), 'Concerts', 5807, 45, 9, 1827, 'Return To Forever', datetime.datetime(2008, 1, 1, 15, 0)),
 (datetime.date(2008, 1, 1), 'Concerts', 5267, 47, 9, 1827, 'Fab Faux', datetime.datetime(2008, 1, 1, 19, 0))]